## staging: api_gateway
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2021-11-23T16:26:47Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:005133826942:rpjvmf2ukd/" -> (known after apply)
      ~ id            = "4xc9c1" -> (known after apply)
      ~ invoke_url    = "https://rpjvmf2ukd.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2021-11-23T16:26:47Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "4xc9c1" -> (known after apply)
        id                    = "ags-rpjvmf2ukd-staging"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_wafv2_web_acl.metrics_collection will be updated in-place
  ~ resource "aws_wafv2_web_acl" "metrics_collection" {
        id          = "378af4bf-0cc4-466d-b45f-68231da0cb7a"
        name        = "metrics_collection1"
        tags        = {}
        # (6 unchanged attributes hidden)


      + rule {
          + name     = "metrics_collection_invalid_path"
          + priority = 10

          + action {

              + block {
                  + custom_response {
                      + response_code = 200
                    }
                }
            }

          + statement {

              + not_statement {
                  + statement {

                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "/save-metrics"

                          + field_to_match {

                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "metrics_collection_invalid_path"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 10 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }

        # (8 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url = "https://rpjvmf2ukd.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>